[
  {
	"name": "Statue",
    "triggerType": "nsc",
    "mass": 0,
    "height": 1000,
    "width": 500,
    "position": "2000, 0",
    "health":1000,
	"dialogues": 
		[
			{	
				"spokesman":
					[
						"Statue",
						"Nyr",
						"Statue",
						"Nyr",
						"Statue",
						"Statue",
						"Nyr",
						"Statue",
						"Nyr",
						"Nyr",
						"Statue",
						"Nyr",
						"Statue",
						"Statue"
					],
				"speeches":
					[
						"Courageous one, you showed great valour before your life perished and I have thus judged thee worthy to stand in front of me now.", 
						"Where...am I?" ,
						"This is the Underworld. A place where the restless souls reside. I have called you before me to ask of you this. Would you serve me as a Valkyrie?",
						"A Valkyrie...?",
						"A divine being that leads the dead and fights against the twisted monsters that spring from the miasma of human emotions.",
						"They keep order in this world alongside an army of dead souls, who have risen to join their cause.",
						"..." ,
						"As a Valkyrie you will also decide the fate of the souls that have fallen in battle. Whether their souls shall rest eternally or continue their fate in the Underworld.",
						"...!",
						"How can I become a Valkyrie?",
						"I seem to have awoken your interest. To become a Valkyrie, I would have you forge your own army and pass a trial.",
						"What kind of trial is it?",
						"You shall see, one that will make you worthy of becoming my Valkyrie.",
						"Now I ask of you again. Do you want to become a Valkyrie?"
					]
			}
		]
  },{
	"name": "drWhich",
    "triggerType": "nsc",
    "mass": 0,
    "height": 200,
    "width": 220,
    "position": "3000, 1000",
    "health":1000,
	"dialogues": 
		[
			{	
				"spokesman":
					[
						"Dr Which",
						"Nyr",
						"Dr Which",
						"Nyr",
						"Dr Which"
					],
				"speeches":
					[
						"Do you like to die less often?", 
						"Well, that would be great I guess." ,
						"Then i shall raise your health.",
						"Thanks~",
						"Now hand me the fee of 500g."						
					]
			}
		]
  },
  {
	"name": "inaSoul",
    "triggerType": "nsc",
    "mass": 0,
    "height": 100,
    "width": 100,
    "position": "1000, 1500",
    "health":1000,
	"dialogues": 
		[
			{	
				"spokesman":
					[
						"Ina",
						"Nyr",
						"Ina",
						"Nyr",
						"Ina",
						"Nyr",
						"Ina",
						"Nyr",
						"Ina",
						"",
						"Nyr",
						"Ina",
						"Nyr",
						"Ina",
						"Nyr"
					],
				"speeches":
					[
						"Compared to your words, this place seems pretty run down to me.",
						"It is a graveyard after all.",
						"What? You like this sort of thing?",
						"Not particularly. But, it's quiet and peaceful.",
						"I see. By the way, you look pretty run-down too. Don't you have any better equipment?",
						"It's the only things I have... Although you on the other hand look beautiful in your human form.",
						"...! T-thanks.",
						"? Is something the matter?",
						"Anyways, take this, you'll need it.",
						"-Armor enhanced with Ina's power-",
						"This is...!",
						"When you press [Key], you'll create a huge fire blast around you.",
						"Thank you. You really are kind...",
						"Huh?! Argh, people like you make no sense. Now go already!",
						"...?"
					]
			},
			{	
				"spokesman":
					[
						"Ina",
						"Nyr",
						"Ina",
						"Nyr",
						"Ina",
						"Nyr",
						"Ina",
						"Nyr",
						"Ina"
					],
				"speeches":
					[
						"This place is way too dark! I know, how about I light it all up?",
						"I think everything will burn down instead...",
						"I'll be careful, they'll only only be small, that would be fine right?",
						"Don't!",
						"...!",
						"Ah, sorry. I just remembered something...",
						"S-sor-",
						"Besides, you can see the night sky so much better this way.",
						"...Yeah, you're right."
					]
			}
		]
  },
  {
	"name": "yinyinSoul",
    "triggerType": "nsc",
    "mass": 0,
    "height": 100,
    "width": 100,
    "position": "1000, 2000",
    "health":1000,
	"dialogues": 
		[
			{	
				"spokesman":
					[
						"Yinyin",
						"Nyr",
						"Yinyin",
						"",
						"Nyr",
						"Yinyin"
					],
				"speeches":
					[
						"Thank you for the invite. I'll make sure to show you an even better performance the next time.",
						"As long as it's not quite as engaging...",
						"Hehe. That I cannot promise. But for now, at the very least, I can give you this. I'll be watching your splendid show.",
						"-Gauntlet enhanced with Yinyin's power-" ,
						"Thank you!",
						"You can shoot ice spikes by using [Key]. Make sure to use it well."
					]
			},
			{	
				"spokesman":
					[
						"Nyr",
						"Yinyin",
						"Nyr",
						"Yinyin",
						"Nyr",
						"Yinyin",
						"Nyr",
						"Yinyin",
						"Nyr",
						"Yinyin",
						"Nyr",
						"Yinyin",
						"Nyr",
						"Yinyin",
						"Nyr",
						"Nyr",
						"Yinyin",
						"Nyr"
					],
				"speeches":
					[
						"I see you're practicing again." ,
						"I always have to keep myself in shape, even with the touch of undeath." ,
						"What was that move you just did now?" ,
						"A chaines turn." ,
						"I see the quick steps look really beautiful." ,
						"Thank you. If you are interested, I could teach you a few moves. How about the dying swan?" ,
						"N-no thank you... I don't think I would look even half as graceful as you when I try..." ,
						"You would be just as captivating though. Comedy is also an art form, you know?" ,
						"Well, I'm busy fighting monsters..." ,
						"Fighting and dancing are quite similar." ,
						"Yeah, for example that kick you threw at me." ,
						"That was a grand jete leap." ,
						"It just looked like an elegant flying kick to me..." ,
						"I can gladly show you a flying kick." ,
						"Uh-",
						"What's this?" ,
						"A reverence. A display of respect as a thank you for before." ,
						"I see. Thank you as well, though I will still decline your offer." 
					]
			}
		]
  },
  {
	"name": "aiyeSoul",
    "triggerType": "nsc",
    "mass": 0,
    "height": 100,
    "width": 100,
    "position": "1500, 2000",
    "health":1000,
	"dialogues": 
		[
			{	
				"spokesman":
					[
						"Aiye",
						"Nyr",
						"Aiye",
						"",
						"Nyr",
						"Aiye",
						"Aiye"
					],
				"speeches":
					[
						"Yo. Finally here to grace me with your beauty?",
						"Hello, it's good to see you again as well.",
						"Ignored huh... well anyway. Step closer, I got a little gift for you!" ,
						"-Boots enhanced with Aiye's power-",
						"Oh, thank you!",
						"These shoes will help ya.",
						"Now that we've come this far. How about we relax from all this fighting and go out som-"
					]
			},
			{	
				"spokesman":
					[
						"Aiye",
						"Nyr",
						"Aiye",
						"Nyr",
						"Aiye",
						"Nyr",
						"Aiye",
						"Nyr",
						"Aiye",
						"Nyr",
						"Aiye",
						"Nyr",
						"Aiye",
						"Nyr"
					],
				"speeches":
					[
						"There are others like me, you might be interested in." ,
						"..." ,
						"Hey don't be so cold now, you might get something good out of this!" ,
						"..." ,
						"Everyone here has regrets from when they were alive." ,
						"A regret?" ,
						"Something that you never achieved, or a mistake from the past, something that was never set right." ,
						"...I guess, I can understand that." ,
						"I for one would love a palace full of beauties, hahaha! Like an elgant icy woman or just a really hot one!" ,
						"*sighs*" ,
						"What's with that disappoint face!? You can't tell me you don't want to see it. Or perhaps you might be more ec-static to see a man with torn clothes?" ,
						"I don't have any particular interest in such things. But if they're like you, then I'd love to meet them as well." ,
						"I see. But do not worry, my heart will always stay true to you! So, about our next date, how about going to the top of the tower. I think we can see the night sky..." ,
						"..." 
					]
			}
		]
  },
  {
	"name": "monomonoSoul",
    "triggerType": "nsc",
    "mass": 0,
    "height": 100,
    "width": 100,
    "position": "1500, 1500",
    "health":1000,
	"dialogues": 
		[
			{	
				"spokesman":
					[
						"Monomono",
						"Nyr",
						"Monomono",
						"Nyr",
						"Monomono",
						"Nyr",
						"Monomono",
						"Nyr",
						"Monomono",
						"Nyr"
					],
				"speeches":
					[
						"This place is interesting. All these materials that do not exist in the realm of living. Whole new possibilities I could create with these! Where do I even begin!?",
						"You seem to enjoy yourself...",
						"Ah, there you are. I've been waiting for you!",
						"Why- Wait, don't come so close!",
						"There. Be thankful.",
						"This is...",
						"I enhanced your headband with my power. You should be able to dash on ground and in the air with this! You can dash by using [Key].",
						"Is this safe...?",
						"... It will work perfectly fine! I calculated everything correctly.",
						"Thank you. I'll make sure to use it well..."
					]
			},
			{	
				"spokesman":
					[
						"Monomono",
						"Nyr",
						"Monomono",
						"Nyr",
						"Monomono",
						"Nyr",
						"Monomono",
						"Nyr",
						"Monomono",
						"Nyr",
						"Monomono",
						"Nyr",
						"Monomono"
					],
				"speeches":
					[
						"Isn't it amazing, how all of us are so different?" ,
						"Isn't that natural?" ,
						"It's not only our personalities. Think about it! All of us are have a vastly different pasts. Things that occurred in my time may or may not necessarily happen in your past nor future. Although, they do say history repeats itself." ,
						"I never noticed that..." ,
						"Furthermore, there are even some beings in this realm that could never exist in the world we knew." ,
						"The stories of dragon, the use of magic and such places and cultures that didn't exist in time..." ,
						"Correct! Alchemy, magic, creatures that we have imagined but proven to not exist. They exist here as well, as in their previous world." ,
						"This place is full of mysteries..." ,
						"I am most interested in that goddess. How far does her power reach, and what is her true purpose? It is also unsettling seeing the tears of blood running down her face. What reason could have led to that?" ,
						"I see, you're having a lot of fun.",
						"Yes, I won't be bored for a long time, if ever! On that note, there's something I would like you to try. This was made with the help of alchemy. It should greatly increase your power, though I do not know what other effects it might have. You just need to drink this. Do it for Science!" ,
						"...",
						"How strange. Where did she go?" 
					]
			}
		]
  }
]